of60/tutorials/run_debugSolverRheoThermToolLibso/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 250.0
    volVectorFieldValue U (0 0 0)
);

regions
(
    // Set cell values (does zerogradient on boundaries)
    boxToCell
    {
        box (-0.25 -0.25 -1) (0.25 0.25 1);
        fieldValues
        (
            volScalarFieldValue T 300.0
	    volVectorFieldValue U (2 -1 0)
        );
    }

    // Set patch values (using ==)
    boxToFace
    {
        box (-0.25 -0.25 -1) (0.25 0.25 1);

        fieldValues
        (
            volScalarFieldValue T 300.0
            volVectorFieldValue U (2 -1 0)
        );
    }

);


// ************************************************************************* //
